Revit 2027 API
ViewDuplicateOption Enumeration
 Options for duplicating views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewDuplicateOption
Public Enumeration ViewDuplicateOption
public enum class ViewDuplicateOption
type ViewDuplicateOption
Members
Member name | Value | Description
AsDependent | 1 |  Duplicate as Dependent
Duplicate | 0 |  Duplicate view
WithDetailing | 2 |  Duplicate with Detailing
See Also
Reference
Autodesk.Revit.DB Namespace